Catalogs/тсШаблоныПечатныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>тсШаблоныПечатныхДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНаПримереДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКШаблонуWord</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоТега</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецТега</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ИмяФайлаШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеФайлаШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрикрепляемогоФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИсходящихПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТегРегНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТегРегДата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИсходящуюКорреспонденцию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлДок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеШаблона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыИСвойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаДляПолученияЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДопСвойства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектДопСвойства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоля</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПолейУЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПустоеЗначениеНеПробел</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбласти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаВыбораТаблиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьИтоги</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаТаблиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДополнительногоОтбора</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвязьСоСтрокойПоПолю</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитТЧ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СинонимДополнительногоОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеТаблицы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКолонок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеСвойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Comment>Заголовок </Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбластиШаблона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяОбласти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбласти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/тсШаблоныПечатныхДокументов/Ext/ManagerModule.bsl
Функция ФорматУниверсальногоФайла() Экспорт

	Возврат ".docx";

КонецФункции

Процедура ВыделитьПараметры(МассивПараметров, Знач Текст) Экспорт

	НачалоТега = "{v8 ";
	КонецТега = "}";
	
	НачалоПараметра = СтрНайти(Текст, НачалоТега);
	
	Если НачалоПараметра <= 0 Тогда
	
		Возврат;
	
	КонецЕсли;

	Текст = Прав(Текст, СтрДлина(Текст) - (НачалоПараметра + СтрДлина(НачалоТега) - 1));
	КонецПараметра = СтрНайти(Текст, КонецТега);
	Если КонецПараметра > 0 Тогда
	
		ТекстПараметра = СокрЛП(Лев(Текст, КонецПараметра - 1));
		МассивПараметров.Добавить(ТекстПараметра);
		Текст = Прав(Текст, СтрДлина(Текст) - (СтрДлина(ТекстПараметра) + 1));
	
	КонецЕсли;
	
	НачалоПараметра = СтрНайти(Текст, НачалоТега);
	Если НачалоПараметра > 0 Тогда
	
		ВыделитьПараметры(МассивПараметров, Текст);
	
	КонецЕсли;

КонецПроцедуры

Функция НастройкаСоответствияРеквизитов(ВидШаблона) Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тсШаблоныПечатныхДокументовРеквизитыИСвойства.Поле КАК Поле,
	|	тсШаблоныПечатныхДокументовРеквизитыИСвойства.ИмяОбласти КАК ИмяОбласти,
	|	тсШаблоныПечатныхДокументовОбластиШаблона.ТипОбласти КАК ТипОбласти,
	|	тсШаблоныПечатныхДокументовРеквизитыИСвойства.Значение КАК Значение,
	|	тсШаблоныПечатныхДокументовРеквизитыИСвойства.Функция КАК Функция,
	|	тсШаблоныПечатныхДокументовРеквизитыИСвойства.ТипПоля КАК ТипПоля,
	|	тсШаблоныПечатныхДокументов.НачалоТега КАК НачалоТега,
	|	тсШаблоныПечатныхДокументов.КонецТега КАК КонецТега,
	|	тсШаблоныПечатныхДокументовРеквизитыИСвойства.СтрокаХранилище КАК СтрокаХранилище
	|ПОМЕСТИТЬ втРеквизитыОбласти
	|ИЗ
	|	Справочник.тсШаблоныПечатныхДокументов.РеквизитыИСвойства КАК тсШаблоныПечатныхДокументовРеквизитыИСвойства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.тсШаблоныПечатныхДокументов КАК тсШаблоныПечатныхДокументов
	|		ПО тсШаблоныПечатныхДокументовРеквизитыИСвойства.Ссылка = тсШаблоныПечатныхДокументов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.тсШаблоныПечатныхДокументов.ОбластиШаблона КАК тсШаблоныПечатныхДокументовОбластиШаблона
	|		ПО тсШаблоныПечатныхДокументовРеквизитыИСвойства.ИмяОбласти = тсШаблоныПечатныхДокументовОбластиШаблона.ИмяОбласти
	|			И (тсШаблоныПечатныхДокументовОбластиШаблона.ТипОбласти <> ""СтрокаТаблицы"")
	|ГДЕ
	|	тсШаблоныПечатныхДокументовРеквизитыИСвойства.Ссылка = &Ссылка
	|	И тсШаблоныПечатныхДокументовРеквизитыИСвойства.Используется = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеквизитыОбласти.Поле КАК Поле,
	|	втРеквизитыОбласти.ИмяОбласти КАК ИмяОбласти,
	|	втРеквизитыОбласти.ТипОбласти КАК ТипОбласти,
	|	втРеквизитыОбласти.Значение КАК Значение,
	|	втРеквизитыОбласти.Функция КАК Функция,
	|	втРеквизитыОбласти.ТипПоля КАК ТипПоля,
	|	втРеквизитыОбласти.НачалоТега КАК НачалоТега,
	|	втРеквизитыОбласти.КонецТега КАК КонецТега,
	|	втРеквизитыОбласти.СтрокаХранилище КАК СтрокаХранилище
	|ИЗ
	|	втРеквизитыОбласти КАК втРеквизитыОбласти
	|ГДЕ
	|	втРеквизитыОбласти.ТипОбласти = ""Общая""
	|	И втРеквизитыОбласти.ИмяОбласти <> ""Абзац""";
	
	Запрос.УстановитьПараметр("Ссылка", ВидШаблона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	ВыборкаДетальныеЗаписи.Свернуть("Поле, ИмяОбласти, ТипОбласти, Значение, Функция, ТипПоля, НачалоТега, КонецТега, СтрокаХранилище");
	
	Возврат ВыборкаДетальныеЗаписи;

КонецФункции

Функция НастройкаСоответствияТабличнойЧасти(ВидШаблона) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тсШаблоныПечатныхДокументов.НачалоТега КАК НачалоТега,
		|	тсШаблоныПечатныхДокументов.КонецТега КАК КонецТега,
		|	тсШаблоныПечатныхДокументовТаблицаВыбораТаблиц.ПолеТаблицы КАК ИмяОбласти,
		|	тсШаблоныПечатныхДокументовОбластиШаблона.ТипОбласти КАК ТипОбласти,
		|	тсШаблоныПечатныхДокументовТаблицаВыбораТаблиц.Функция КАК ФункцияОбласти,
		|	тсШаблоныПечатныхДокументовТаблицаТаблиц.Поле КАК Поле,
		|	тсШаблоныПечатныхДокументовТаблицаТаблиц.Значение КАК Значение,
		|	тсШаблоныПечатныхДокументовТаблицаТаблиц.Функция КАК Функция
		|ИЗ
		|	Справочник.тсШаблоныПечатныхДокументов.ТаблицаВыбораТаблиц КАК тсШаблоныПечатныхДокументовТаблицаВыбораТаблиц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.тсШаблоныПечатныхДокументов.ОбластиШаблона КАК тсШаблоныПечатныхДокументовОбластиШаблона
		|		ПО тсШаблоныПечатныхДокументовТаблицаВыбораТаблиц.ПолеТаблицы = тсШаблоныПечатныхДокументовОбластиШаблона.ИмяОбласти
		|			И (тсШаблоныПечатныхДокументовОбластиШаблона.ТипОбласти = ""СтрокаТаблицы"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.тсШаблоныПечатныхДокументов.ТаблицаТаблиц КАК тсШаблоныПечатныхДокументовТаблицаТаблиц
		|		ПО тсШаблоныПечатныхДокументовТаблицаВыбораТаблиц.UID = тсШаблоныПечатныхДокументовТаблицаТаблиц.UID
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.тсШаблоныПечатныхДокументов КАК тсШаблоныПечатныхДокументов
		|		ПО тсШаблоныПечатныхДокументовТаблицаВыбораТаблиц.Ссылка = тсШаблоныПечатныхДокументов.Ссылка
		|ГДЕ
		|	тсШаблоныПечатныхДокументовТаблицаВыбораТаблиц.Ссылка = &Ссылка
		|	И тсШаблоныПечатныхДокументовТаблицаВыбораТаблиц.Используется = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИмяОбласти";
	
	Запрос.УстановитьПараметр("Ссылка", ВидШаблона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Возврат ВыборкаДетальныеЗаписи;

КонецФункции

Функция ПорядокОбластей(ВидШаблона) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тсШаблоныПечатныхДокументовОбластиШаблона.ИмяОбласти КАК ИмяОбласти,
		|	тсШаблоныПечатныхДокументовОбластиШаблона.ТипОбласти КАК ТипОбласти
		|ИЗ
		|	Справочник.тсШаблоныПечатныхДокументов.ОбластиШаблона КАК тсШаблоныПечатныхДокументовОбластиШаблона
		|ГДЕ
		|	тсШаблоныПечатныхДокументовОбластиШаблона.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	тсШаблоныПечатныхДокументовОбластиШаблона.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ВидШаблона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Возврат ВыборкаДетальныеЗаписи;

КонецФункции // ()

Функция УжеЕстьПрикрепление(Основание, ТипПрикрепляемогоФайла) Экспорт

	Возврат ОбъектыСервер.ПроверитьТипФайлаОбъекта(Основание, ТипПрикрепляемогоФайла.Код);

КонецФункции // ()
